/* 信息安全 1952889 鲁灵伊 */
/*menu及相关函数的实现*/
#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <iomanip>
#include <ctime>
#include <cmath>
#include <cstdio>
#include <conio.h>
#include <Windows.h>
#include "cmd_console_tools.h"
#include "mine_sweeper.h"
using namespace std;

/***************************************************************************
函数名称：
功    能：打印主菜单
输入参数：
返 回 值：
说    明：
***************************************************************************/
void msm_showmenu()
{
	cout << "-------------------------------------------";
	cout << endl;
	cout << "1.选择难度并显示内部数组" << endl;
	cout << "2.输入初始位置并显示被打开的初始区域" << endl;
	cout << "3.内部数组基础版" << endl;
	cout << "4.内部数组完整版（标记、运行时间）" << endl;
	cout << "5.画出伪图形化框架并显示内部数据" << endl;
	cout << "6.检测鼠标位置和合法性（左键单击退出）" << endl;
	cout << "7.鼠标选择初始位置并显示被打开的初始区域" << endl;
	cout << "8.伪图形界面基础版" << endl;
	cout << "9.伪图形界面完整版" << endl;
	cout << "0.退出游戏" << endl;
	cout << "-------------------------------------------";
	cout << endl;
	cout << "[请选择] : ";

	return;
}

/***************************************************************************
函数名称：
功    能：打印副菜单
输入参数：
返 回 值：
说    明：
***************************************************************************/
void msm_showsub_menu()
{
	cct_cls();
	cout << "请选择难度:" << endl;
	cout << "  1.初级( 9*9  - 10颗雷)" << endl;
	cout << "  2.中级(16*16 - 40颗雷)" << endl;
	cout << "  3.高级(16*30 - 99颗雷)" << endl;
	cout << "请输入[1..3]:";

	return;
}

/***************************************************************************
函数名称：
功    能：打印输入提示
输入参数：
返 回 值：
说    明：
***************************************************************************/
void msm_showinput()
{
	cout << "输入非雷位置的行列坐标";
	cout << "(先行后列，严格区分大小写，例：G1/Af，按Q/q退出): ";

	return;
}

/***************************************************************************
函数名称：
功    能：打印特殊输入提示
输入参数：
返 回 值：
说    明：
***************************************************************************/
void msm_shownote()
{
	cout << "特殊输入说明：& - 游戏已运行时间(单字符即可，不需要加坐标)" << endl;
	cout << "              ! - 标记该坐标为雷(例：!E3)" << endl;
	cout << "              # - 取消标记      (例：#E3)" << endl;

	return;
}

/***************************************************************************
函数名称：
功    能：选择菜单
输入参数：
返 回 值：
说    明：
***************************************************************************/
char msm_choosemenu(char move)
{
	char command;
	{
		switch (move)
		{
			case '1':
				while (1)
				{
					command = _getch();
					if (command >= '0' && command <= '9')
						break;
					else
						continue;
				}
				break;
			case '2':
				while (1)
				{
					command = _getch();
					if (command >= '1' && command <= '3')
						break;
					else
						continue;
				}
				break;
		}
		
	}
	cout << command << endl;
	cout << endl;
	cout << endl;
	return command;
}